In [1]:
import numpy as np
import pandas as pd

In [2]:
df_new = pd.read_csv('files/sample_1.csv')
df_new

      name  age state  point
0    Alice   24    NY     64
1      Bob   42    CA     92
2  Charlie   18    CA     70
3     Dave   68    TX     70
4    Ellen   24    CA     88
5    Frank   30    NY     57

# сразу два шага сортировки в одной строчке кода выглядят так
#### сохраняем результат в переменную sorted_df

In [3]:
sorted_df=df_new.sort_values(['age', 'state'], ascending=[True, False])
sorted_df

      name  age state  point
2  Charlie   18    CA     70
0    Alice   24    NY     64
4    Ellen   24    CA     88
5    Frank   30    NY     57
1      Bob   42    CA     92
3     Dave   68    TX     70

# но мы можем сделать то же самое в 2 этапа для наглядности
#### используем inplace=True, чтобы сохранить в переменной df_new результат 1-й сортировки

### 1 этап сортировки

In [4]:
df_new.sort_values(['state'], ascending=[False], inplace=True)
df_new

      name  age state  point
3     Dave   68    TX     70
0    Alice   24    NY     64
5    Frank   30    NY     57
1      Bob   42    CA     92
2  Charlie   18    CA     70
4    Ellen   24    CA     88

### 2 этап сортировки

In [5]:
result = df_new.sort_values(['age'], ascending=[True])
result

      name  age state  point
2  Charlie   18    CA     70
0    Alice   24    NY     64
4    Ellen   24    CA     88
5    Frank   30    NY     57
1      Bob   42    CA     92
3     Dave   68    TX     70

#### Конечный результат второй сортировки сохраняем в переменную result и сравниваем с датафреймом в sorted_df

In [6]:
sorted_df == result

   name   age  state  point
2  True  True   True   True
0  True  True   True   True
4  True  True   True   True
5  True  True   True   True
1  True  True   True   True
3  True  True   True   True